spec/dummy/app/controllers/application_controller.rb

SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1
UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "saved name"], ["updated_at", "2016-06-30 14:20:39.469134"], ["id", 1]]
---
  def saved
    @user = User.last
    @user.update_attributes(first_name: "saved name")

SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1
---
  def dirty
    @user = User.last